export const sunmar = {
    methods: {

    },
    data() {
        return {
            tasksInfo: [
                {
                    name: 'Первое задание',
                    num: 1,
                    text: 'А вот и первое задание! Вступи в группу SunMar и оставайся среди участников как минимум до окончания конкурса! Просто, не правда ли?' 
                },
                {
                    name: 'Второе задание',
                    num: 2,
                    text: 'Пссс! Ты тут? Вот твоё второе задание! Смотри не подведи! Поделись любым постом из группы SunMar у себя на странице, скопируй ссылку своего репоста и пришли её мне!' 
                },
                {
                    name: 'Третье задание',
                    num: 3,
                    text: 'Ты еще не забыл о нас? Есть новое задание! Размести фотографию из самого классного путешествия на своей странице с хэштегом #SunMar и пришли ссылку на этот пост мне! Справишься? ' 
                },
                {
                    name: 'Четвертое задание',
                    num: 4,
                    text: 'Хэхэй! Скучали? Лови викторину! Отвечай на 4 легких вопроса, отправляя мне сообщения с ответами! Ты готов? Пиши — Да!' 
                },
                {
                    name: 'Пятое задание',
                    num: 5,
                    text: `Пссс! Еще одно интересное задание для тебя! Будем раздавать лайки! 
                    Переходи в группу @KFC_BATTLE и лайкни 10 любых
                    постов, а потом сделай то же самое в группе SunMar!
                    Только внимательно! Я проверю!`
                },
                {
                    name: 'Шестое задание',
                    num: 6,
                    text: 'Как успехи? Пока ты не лайкаешь, лайкают другие! Ты выполнил задание?' 
                },
                {
                    name: 'Седьмое задание',
                    num: 7,
                    text: `А вот и финал! Ты выполнил все задания, осталось лишь
                    оставить комментарий «Я выполнил все задания!» под этим постом: %ссылка` 
                },
            ]
        };
    }
};